wang521258/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000，二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键（GPIO0）5 秒，由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:UART0 ---
# 【本版本专供 QEMU/WASM 模拟器验证】QEMU 不支持 USB-Serial-JTAG,必须用 UART0 才能启动。
# 注意:官方默认用 USB-Serial-JTAG,原因是"UART0 默认 TX=GPIO21 与本板背光引脚冲突"。
# 因此本配置编出的固件仅用于模拟器验证玩法;刷真机前需改回 JTAG 再编一版。
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_TX_GPIO=21
CONFIG_ESP_CONSOLE_UART_RX_GPIO=20
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- 调试:崩溃时打印调用栈再重启,便于定位问题 ---
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# cn_16 子集字库由 lv_font_conv 生成，glyph 位图是 RLE 压缩格式(bitmap_format=1)。
# 此开关必须打开，否则 lv_font_get_bitmap_fmt_txt 对压缩字形返回空 → 中文全部不显示
#（2026-09-10 模拟器实测：顶栏按钮/攻字/中文选项全空白，即此根因）。
CONFIG_LV_USE_FONT_COMPRESSED=y
# 中文不依赖 LVGL 内置字库：LVGL 9.5 已移除 SIMSUN，内置思源黑体子集又只含 1187 个
# CJK 字符（本项目要 1142 汉字，缺 722 个）。改用 main/lv_font_cn_16.c（自生成子集，
# 100% 覆盖，约 88KB），由 tools/gen_font.py 生成。
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 宠物页 65+ LVGL 对象 + canvas + 状态条 + 训练面板,24KB 装不下(s_namelabel 等返回 NULL
# 导致后续 lv_label_set_text 写入 0x0 段错误)。提到 48KB 后动态堆从 81KB 降到约 57KB,
# 仍够 GIFIMAGE 9KB + canvas buf 8KB 的一次性分配。Petit page 主菜单等其他 demo 也更稳。
CONFIG_LV_MEM_SIZE_KILOBYTES=48

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
